const MAP_DATA = {
    places: {
        "חצור": [33.017, 35.568],
        "מגידו": [32.585, 35.184],
        "גזר": [31.875, 34.920],
        "שכם": [32.214, 35.282],
        "ירושלים": [31.768, 35.214],
        "דן": [33.249, 35.652],
        "בית אל": [31.940, 35.239],
        "אבל בית מעכה": [33.252, 35.549],
        "פנואל": [32.180, 35.630],
        "תרצה": [32.323, 35.376],
        "שומרון": [32.276, 35.190],
        "צרפת": [33.456, 35.302],
        "הר הכרמל": [32.741, 35.018],
        "יזרעאל": [32.564, 35.332],
        "באר שבע": [31.243, 34.793],
        "גלגל": [31.860, 35.440],
        "יריחו": [31.860, 35.455],
        "רמות גלעד": [32.550, 36.000],
        "קדש": [33.115, 35.539],
        "נינוה": [36.360, 43.150],
        "כרכמיש": [36.830, 38.010],
        "לבא חמת": [34.350, 36.500],
        "אילת": [29.540, 34.980],
        "רבלה": [34.460, 36.550],
        "דמשק": [33.513, 36.276],
        "הר חורב": [28.540, 33.970],
        "כנרת": [32.820, 35.580],
        "ינוח": [32.960, 35.250],
        "עיון": [33.382, 35.623],
        "חלח": [36.000, 43.500],
        "נהר חבור": [35.100, 40.700],
        "גוזן": [36.800, 40.060],
        "ערי מדי": [35.500, 47.000],
        "תפסח": [35.773, 38.758],
        "עזה": [31.5, 34.45],
        "עציון גבר": [29.54, 34.98],
        "נחל מצרים": [31.13, 33.8],
        "נחל כרית": [32.410, 35.749],
        "נהר הירדן": [32.10, 35.58]
    },

    practiceList: [
        "חצור", "מגידו", "גזר", "שכם", "ירושלים", "דן", "בית אל",
        "אבל בית מעכה", "פנואל", "תרצה", "שומרון", "נחל כרית",
        "צרפת", "הר הכרמל", "יזרעאל", "באר שבע", "נהר הירדן",
        "גלגל", "יריחו", "רמות גלעד", "קדש"
    ],

    regions: {
        "ארם": [33.8, 36.5, "medium"],
        "צור": [33.25, 35.0, "small"],
        "צידון": [33.56, 35.25, "small"],
        "שבא": [14.4, 44.2, "medium"],
        "מצרים": [29.3, 31.8, "medium"],
        "ממלכת ישראל": [32.0, 35.1, "medium"],
        "ישראל": [32.5, 35.1, "medium"],
        "ממלכת יהודה": [31.45, 35.0, "medium"],
        "יהודה": [31.45, 35.0, "medium"],
        "עמון": [32.0, 36.2, "small"],
        "מואב": [31.3, 36.0, "small"],
        "אדום": [30.4, 35.5, "small"],
        "הגלעד": [32.45, 35.78, "medium"],
        "גלעד": [32.45, 35.78, "medium"],
        "הגליל": [33.0, 35.35, "medium"],
        "אשור": [35.8, 42.5, "large"],
        "בבל": [32.5, 44.4, "large"],
        "האימפריה הבבלית": [32.5, 44.4, "xlarge"],
        "פלשתים": [31.5, 34.2, "small"],
        "חתים": [34.8, 36.3, "small"],
        "נהר פרת": [36.1, 39.4, "small"]
    },

    polygons: {
        "solomon": [
            [29.54, 34.98],
            [29.8, 35.3],
            [30.4, 35.8],
            [31.321, 36.138],
            [31.794, 36.32],
            [32.036, 36.441],
            [32.334, 36.594],
            [32.82, 36.814],
            [33.02, 36.962],
            [33.271, 37.27],
            [33.628, 37.649],
            [33.98, 38.274],
            [34.371, 39.516],
            [34.502, 39.978],
            [34.805, 40.236],
            [35.052, 40.324],
            [35.488, 39.851],
            [35.689, 39.582],
            [35.885, 39.209],
            [35.95, 38.8],
            [36.025, 38.7],
            [36.1, 38.6],
            [36.005, 38.154],
            [35.755, 37.808],
            [35.349, 37.457],
            [35.043, 37.155],
            [34.818, 36.809],
            [34.651, 36.468],
            [34.348, 36.177],
            [34.189, 36.084],
            [34.012, 35.913],
            [33.765, 35.76],
            [33.619, 35.644],
            [33.477, 35.49],
            [33.248, 35.282],
            [33.087, 35.073],
            [32.921, 35.079],
            [32.824, 34.963],
            [32.51, 34.897],
            [32, 34.7],
            [31.719, 34.578],
            [31.382, 34.293],
            [31.199, 33.979],
            [31.1, 33.7],
            [30.4, 34.3],
            [29.8, 34.8]
        ],
        "israel": [
            [31.95, 34.88],
            [31.977, 34.813],
            [31.9906, 34.7992],
            [31.9941, 34.7937],
            [31.9964, 34.7786],
            [32.03, 34.743],
            [32.081, 34.757],
            [32.1105, 34.7772],
            [32.296, 34.838],
            [32.4078, 34.8651],
            [32.5, 34.9],
            [32.824, 34.958],
            [32.7988, 35.0052],
            [32.8242, 35.0327],
            [32.8727, 35.0711],
            [32.9557, 35.0821],
            [33.032, 35.085],
            [33.0869, 35.0876],
            [33.1284, 35.1398],
            [33.227, 35.206],
            [33.2892, 35.2167],
            [33.3626, 35.2441],
            [33.45, 35.3],
            [33.5299, 35.354],
            [33.5002, 35.4117],
            [33.4933, 35.4858],
            [33.5391, 35.5353],
            [33.6969, 35.6589],
            [33.775, 35.744],
            [33.85, 35.793],
            [34.014, 35.884],
            [34.214, 35.997],
            [34.3502, 36.2],
            [34.482, 36.34],
            [34.5133, 36.4746],
            [34.5043, 36.5652],
            [34.434, 36.659],
            [34.3616, 36.6943],
            [34.3049, 36.6861],
            [34.1959, 36.6422],
            [34.1004, 36.5433],
            [34.0481, 36.4526],
            [33.9548, 36.3235],
            [33.8339, 36.2054],
            [33.681, 36.118],
            [33.4635, 36.0022],
            [33.3397, 35.9637],
            [33.2892, 35.9473],
            [33.211, 35.953],
            [32.993, 35.977],
            [32.868, 36.013],
            [32.6047, 36.0818],
            [32.371, 36.06],
            [32.3359, 36.0352],
            [32.266, 36.016],
            [32.2987, 36.0297],
            [32.2616, 36.0104],
            [32.222, 35.991],
            [32.1454, 35.9528],
            [32.073, 35.945],
            [32.0127, 35.8292],
            [31.9219, 35.7632],
            [31.776, 35.728],
            [31.7328, 35.6891],
            [31.721, 35.637],
            [31.741, 35.5559],
            [31.78, 35.504],
            [31.825, 35.45],
            [31.861, 35.394],
            [31.8799, 35.3691],
            [31.887, 35.354],
            [31.895, 35.3265],
            [31.906, 35.292],
            [31.9347, 35.0876],
            [31.95, 34.88]
        ],
        "judah": [
            [31.95, 34.88],
            [31.9335, 35.0354],
            [31.927, 35.181],
            [31.8939, 35.3375],
            [31.843, 35.464],
            [31.663, 35.467],
            [31.513, 35.3787],
            [31.365, 35.39],
            [31.194, 35.3568],
            [31.062, 35.387],
            [30.9611, 35.3101],
            [30.89, 35.186],
            [30.8126, 35.0766],
            [30.777, 34.95],
            [30.7843, 34.8486],
            [30.8173, 34.7827],
            [30.853, 34.739],
            [30.914, 34.687],
            [31.029, 34.585],
            [31.123, 34.557],
            [31.225, 34.549],
            [31.2832, 34.5493],
            [31.33, 34.588],
            [31.4216, 34.6619],
            [31.508, 34.703],
            [31.623, 34.772],
            [31.7095, 34.7415],
            [31.787, 34.75],
            [31.8799, 34.8212],
            [31.9498, 34.8596],
            [31.95, 34.88]
        ],
        "israel_extended": [
            [31.95, 34.88],
            [32.0174, 34.8129],
            [32.073, 34.785],
            [32.1105, 34.7772],
            [32.296, 34.838],
            [32.4078, 34.8651],
            [32.5, 34.9],
            [32.824, 34.958],
            [32.7988, 35.0052],
            [32.8242, 35.0327],
            [32.8727, 35.0711],
            [32.9557, 35.0821],
            [33.032, 35.085],
            [33.0869, 35.0876],
            [33.1284, 35.1398],
            [33.227, 35.206],
            [33.2892, 35.2167],
            [33.3626, 35.2441],
            [33.45, 35.3],
            [33.4819, 35.4062],
            [33.4681, 35.4721],
            [33.413, 35.522],
            [33.3718, 35.5518],
            [33.3328, 35.5957],
            [33.285, 35.675],
            [33.2685, 35.7358],
            [33.2777, 35.7715],
            [33.259, 35.865],
            [33.2548, 35.9308],
            [33.195, 35.975],
            [32.993, 35.977],
            [32.868, 36.013],
            [32.6047, 36.0818],
            [32.371, 36.06],
            [32.3359, 36.0352],
            [32.266, 36.016],
            [32.2987, 36.0297],
            [32.2616, 36.0104],
            [32.222, 35.991],
            [32.1361, 35.8623],
            [32.0896, 35.7936],
            [32.01, 35.761],
            [31.9125, 35.7469],
            [31.8379, 35.6865],
            [31.747, 35.62],
            [31.7328, 35.501],
            [31.7714, 35.4749],
            [31.839, 35.452],
            [31.8939, 35.3376],
            [31.9265, 35.1851],
            [31.95, 34.88]
        ],

        "judah_extended": [
            [31.95, 34.88],
            [31.945, 35.024],
            [31.92, 35.181],
            [31.8846, 35.3568],
            [31.8099, 35.4694],
            [31.719, 35.638],
            [30.879, 35.678],
            [29.526, 34.904],
            [29.7453, 34.4971],
            [30.017, 34.189],
            [30.42, 33.745],
            [31.255, 34.129],
            [31.674, 34.552],
            [31.992, 34.733],
            [31.95, 34.88]
        ],
        "galilee": [
            [32.234, 35.568],
            [32.324, 35.662],
            [32.5538, 35.799],
            [33.431, 35.62],
            [32.973, 35.186],
            [32.269, 35.502]
        ],
        "border": [
            [32.022, 34.736], [31.902, 35.1871], [31.753, 35.5], [31.9807, 34.7669]
        ],
        "ben_hadad": [
            [33.352, 35.576], [33.059, 35.332], [32.765, 35.524], [33.1094, 35.6479], [33.3334, 35.595]
        ]
    },

    routes: {
        "derech_hayam": [
            [29.9, 33.2], [31.15, 34.25], [32.10, 35.02], [33.02, 35.57], [33.50, 36.20]
        ]
    },

    rivers: {
        "tigris": [
            [38.814, 41.4624],
            [37.3003, 42.6599],
            [36.3594, 43.5059],
            [35.1648, 44.231],
            [34.2799, 44.4177],
            [33.8704, 45.2417],
            [32.8888, 45.9888],
            [30.3824, 49.1418]
        ],
        "euphrates": [
            [38.3158, 38.9575],
            [37.0902, 38.8916],
            [36.324, 38.8586],
            [36.0136, 40.3638],
            [34.8499, 41.1108],
            [34.6242, 42.2864],
            [33.3856, 43.4399],
            [32.482, 45.3186],
            [29.4874, 48.0103]
        ],
        "jorden": [
            [32.7027, 35.5978],
            [32.5428, 35.5744],
            [32.3933, 35.5682],
            [32.1814, 35.5902],
            [32.0133, 35.5737],
            [31.8706, 35.5607],
            [31.7679, 35.5518]


        ],
        "cherith": [
            [32.3823, 35.5682],
            [32.4055, 35.7138],
            [32.3927, 35.8168]
        ]
    },

    bounds: {
        "israel": [[30.000, 33.500], [34.000, 37.000]],
        "solomon": [[28.500, 33.000], [35.500, 39.000]],
        "empires": [[27.000, 28.000], [38.500, 49.000]]
    },

    maps: [
        {
            id: 0,
            title: "מפה כללית: כל המקומות",
            bounds: "israel",
            places: [
                "חצור", "מגידו", "גזר", "שכם", "ירושלים", "דן", "בית אל",
                "אבל בית מעכה", "פנואל", "תרצה", "שומרון", "נחל כרית",
                "צרפת", "הר הכרמל", "יזרעאל", "באר שבע", "נהר הירדן",
                "גלגל", "יריחו", "רמות גלעד", "קדש", "עזה", "עציון גבר", "נחל מצרים"
            ],
            regions: [],
            features: [],
            practicePlaces: []
        },
        {
            id: 1,
            title: "מפה 1: תחום השליטה של ממלכת שלמה",
            bounds: "solomon",
            places: [],
            fadedPlaces: ["תפסח", "לבא חמת", "דן", "ירושלים", "עזה", "נחל מצרים", "עציון גבר", "באר שבע"],
            regions: ["פלשתים", "צור", "חתים", "ארם", "עמון", "מואב", "אדום", "מצרים", "שבא"],
            features: [
                { type: "polygon", id: "solomon", color: "#795548", dashArray: "12, 12", fillOpacity: 0.03 },
                { type: "textlabel", text: "נהר פרת", pos: [36.25, 39.4], rotate: -35, size: "small" }
            ],
            practicePlaces: []
        },
        {
            id: 2,
            title: "מפה 2: ערים ששלמה בנה על דרך הים",
            bounds: "israel",
            places: ["חצור", "מגידו", "גזר"],
            regions: [],
            features: [
                { type: "polygon", id: "solomon", color: "#d4a017", dashArray: "8, 6", fillOpacity: 0.08 },
                { type: "route", id: "derech_hayam", color: "#e67e22", dashArray: "5, 5" }
            ],
            practicePlaces: ["חצור", "מגידו", "גזר"]
        },
        {
            id: 3,
            title: "מפה 3: קשרי המסחר של שלמה",
            bounds: "solomon",
            places: [],
            regions: ["ממלכת ישראל", "מצרים", "ארם", "צור", "שבא"],
            features: [
                { "type": "arrow", "start": [32.1431, 35.126], "end": [33.0685, 35.2441], "color": "#27ae60", "icon": "🌾", "cp1": [32.4356, 35.788], "cp2": [32.9695, 35.5463], "iconPos": [32.2267, 35.0848], "iconSize": 45 },
                { "type": "arrow", "start": [33.1007, 35.1233], "end": [32.15, 34.9887], "color": "#27ae60", "icon": "🌲", "cp1": [33.0823, 34.8102], "cp2": [32.6093, 34.3872], "iconPos": [33.1824, 35.0986], "iconSize": 55 },
                { "type": "arrow", "start": [30.1, 31.2], "end": [31.6814, 34.8926], "color": "#8b4513", "icon": "🐎", "cp1": [30.0786, 32.5635], "cp2": [30.6379, 34.1455], "iconPos": [30.1416, 31.4236], "iconSize": 60 },
                { "type": "arrow", "start": [32.0546, 35.4309], "end": [33.6192, 36.5021], "color": "#8b4513", "icon": "🐎", "cp1": [32.3521, 36.1285], "cp2": [32.7041, 36.6559], "iconPos": [33.6009, 36.3428], "iconSize": 60 },
                { "type": "arrow", "start": [14.435, 44.011], "end": [30.183, 35.013], "color": "#2980b9", "icon": "🚢", "cp1": [21.4092, 37.9372], "cp2": [27.0334, 36.8126], "iconPos": [29.8073, 35.1068], "iconSize": 60 }
            ],
            practicePlaces: ["ארם", "צור", "שבא", "מצרים"]
        },
        {
            id: 4,
            title: "מפה 4: המלכת רחבעם ופילוג הממלכה",
            bounds: "israel",
            places: ["שכם", "ירושלים"],
            fadedPlaces: ["דן", "פנואל", "בית אל"],
            regions: ["יהודה", "ישראל"],
            features: [],
            practicePlaces: ["שכם", "ירושלים"]
        },
        {
            id: 5,
            title: "מפה 5: ממלכת יהודה וישראל",
            bounds: "israel",
            places: ["שכם", "ירושלים", "דן", "בית אל", "פנואל"],
            regions: ["ארם", "צידון", "ישראל", "יהודה", "עמון", "מואב", "פלשתים", "מצרים", "אדום"],
            features: [
                { type: "polygon", id: "judah", color: "#e67e22", dashArray: "" },
                { type: "polygon", id: "israel_extended", color: "#27ae60", dashArray: "" }
            ],
            practicePlaces: []
        },
        {
            id: 6,
            title: "מפה 6: הצבת עגלי הזהב בדן ובבית אל",
            bounds: "israel",
            places: ["דן", "בית אל"],
            fadedPlaces: ["פנואל", "תרצה", "שכם", "ירושלים"],
            regions: ["ישראל", "יהודה"],
            features: [
                { type: "polygon", id: "judah", color: "#e67e22", dashArray: "5, 5" },
                { type: "polygon", id: "israel_extended", color: "#27ae60", dashArray: "5, 5" },
                { type: "icon", icon: "🐂", pos: [33.249, 35.652] },
                { type: "icon", icon: "🐂", pos: [31.940, 35.239] }
            ],
            practicePlaces: ["דן", "בית אל"]
        },
        {
            id: 7,
            title: "מפה 7: השתלטות בן הדד מלך ארם",
            bounds: "israel",
            places: ["דן", "אבל בית מעכה", "כנרת"],
            fadedPlaces: ["עיון", "תרצה", "שכם", "פנואל", "ירושלים", "בית אל"],
            regions: ["ארם", "ישראל"],
            features: [
                { type: "polygon", id: "israel_extended", color: "#27ae60", dashArray: "5, 5" },
                { type: "polygon", id: "ben_hadad", color: "#f49315ff", dashArray: "5, 5" }
            ],
            practicePlaces: ["דן", "אבל בית מעכה"]
        },
        {
            id: 8,
            title: "מפה 8: ערי הבירה של ממלכת ישראל",
            bounds: "israel",
            places: ["פנואל", "שכם", "תרצה", "שומרון"],
            fadedPlaces: ["דן", "בית אל", "ירושלים"],
            regions: ["יהודה", "ישראל", "ארם"],
            features: [
                { type: "polygon", id: "israel_extended", color: "#27ae60", dashArray: "" }
            ],
            practicePlaces: ["פנואל", "תרצה", "שומרון", "שכם"]
        },
        {
            id: 9,
            title: "מפה 9: אליהו בזמן הבצורת",
            bounds: "israel",
            places: ["הר הכרמל", "צרפת"],
            fadedPlaces: [],
            regions: [],
            features: [
                { type: "polygon", id: "israel_extended", color: "#27ae60", dashArray: "5, 5" },
                { type: "riverlabel", text: "נחל כרית", pos: [32.410, 35.749] },
                { type: "river", id: "jorden" },
                { type: "river", id: "cherith" }

            ],
            practicePlaces: ["נחל כרית", "צרפת"]
        },
        {
            id: 10,
            title: "מפה 10: מעמד הר הכרמל",
            bounds: "israel",
            places: ["הר הכרמל", "יזרעאל", "שומרון"],
            regions: [],
            features: [
                { type: "polygon", id: "israel_extended", color: "#27ae60", dashArray: "5, 5" },
                { type: "river", id: "jorden" }

            ],
            practicePlaces: ["הר הכרמל", "יזרעאל", "שומרון"]
        },
        {
            id: 11,
            title: "מפה 11: המקומות בהם עבר אליהו",
            bounds: "israel",
            places: ["צרפת", "הר הכרמל", "יזרעאל", "באר שבע", "בית אל", "גלגל", "יריחו"],
            regions: [],
            features: [
                { type: "textlabel", text: "הגלעד", pos: [32.40, 35.80] },
                { type: "icon", icon: "⛰️", pos: [28.540, 33.970], label: "הר חורב" },
                { type: "river", id: "jorden" },
                { type: "river", id: "cherith" }

            ],
            practicePlaces: ["נחל כרית", "צרפת", "הר הכרמל", "יזרעאל", "באר שבע", "בית אל", "גלגל", "יריחו"]
        },
        {
            id: 12,
            title: "מפה 12: ארם בימי יהודה וישראל",
            bounds: "solomon",
            places: ["ירושלים", "שומרון", "דן", "דמשק", "רמות גלעד", "בית אל"],
            regions: ["ארם", "ישראל", "יהודה"],
            features: [
                { type: "polygon", id: "israel_extended", color: "#27ae60", dashArray: "5, 5" },
                { type: "polygon", id: "judah", color: "#e67e22", dashArray: "5, 5" }
            ],
            practicePlaces: ["ארם"]
        },
        {
            id: 13,
            title: "מפה 13: מלחמת יורם ברמות גלעד",
            bounds: "israel",
            places: ["רמות גלעד", "יזרעאל"],
            fadedPlaces: ["שומרון", "ירושלים"],
            regions: ["ארם"],
            features: [
                { type: "polygon", id: "israel_extended", color: "#27ae60", dashArray: "5, 5" },
                { type: "polygon", id: "judah", color: "#e67e22", dashArray: "5, 5" }
            ],
            practicePlaces: ["רמות גלעד", "יזרעאל"]
        },
        {
            id: 14,
            title: "מפה 14: ממלכות ישראל ויהודה בשיאן",
            bounds: "solomon",
            places: ["לבא חמת", "שומרון", "ירושלים", "אילת"],
            regions: ["ארם", "אשור", "יהודה", "ישראל", "אדום", "מצרים"],
            features: [
                { type: "polygon", id: "israel", color: "#27ae60", dashArray: "" },
                { type: "polygon", id: "judah_extended", color: "#e67e22", dashArray: "" },
                { type: "polygon", id: "solomon", color: "#fa6868ff", dashArray: "" }
            ],
            practicePlaces: []
        },
        {
            id: 15,
            title: "מפה 15: האימפריה האשורית",
            bounds: "empires",
            places: ["נינוה", "כרכמיש"],
            regions: ["אשור", "בבל", "ישראל", "יהודה", "מצרים"],
            features: [
                { type: "river", id: "euphrates" },
                { type: "river", id: "tigris" },
                { type: "riverlabel", text: "נהר פרת", pos: [36.25, 39.4] },
                { type: "riverlabel", text: "נהר החידקל", pos: [34.3, 44.4] }
            ],
            practicePlaces: ["אשור"]
        },
        {
            id: 16,
            title: "מפה 16: הגליית תושבים ע\"י אשור",
            bounds: "israel",
            places: ["אבל בית מעכה", "קדש", "חצור", "עיון"],
            fadedPlaces: ["כנרת", "ינוח", "דן", "פנואל", "שכם", "שומרון", "ירושלים"],
            regions: ["ארם", "ישראל", "יהודה", "הגלעד", "הגליל"],
            features: [
                { type: "polygon", id: "galilee", color: "#ff0000ff", dashArray: "4, 4", fillOpacity: 0.15 },
                { type: "polygon", id: "border", color: "#a0169bff", dashArray: "4, 4", fillOpacity: 0.15 }
            ],
            practicePlaces: ["אבל בית מעכה", "קדש", "חצור", "הגלעד", "הגליל"]
        },
        {
            id: 17,
            title: "מפה 17: הגליית ממלכת ישראל לאשור",
            bounds: "empires",
            places: ["נינוה", "חלח", "נהר חבור", "גוזן", "ערי מדי"],
            regions: ["בבל", "אשור", "ישראל", "יהודה", "מצרים"],
            features: [
                { "type": "arrow", "start": [32.3244, 35.5899], "end": [35.0712, 40.6678], "color": "#c0392b", "cp": [34.3751, 39.137] },
                { "type": "arrow", "start": [32.0899, 35.5806], "end": [35.9321, 43.9367], "color": "#c0392b", "cp": [33.5048, 39.4849] },
                { "type": "arrow", "start": [32.4523, 35.581], "end": [36.8713, 39.9662], "color": "#c0392b", "cp": [35.0048, 37.4159] },
                { "type": "arrow", "start": [31.9444, 35.5398], "end": [35.6042, 47.1694], "color": "#c0392b", "cp": [32.763, 41.5248] },
                { type: "river", id: "euphrates" },
                { type: "river", id: "tigris" },
                { type: "riverlabel", text: "נהר פרת", pos: [36.25, 39.4] },
                { type: "riverlabel", text: "נהר החידקל", pos: [34.3, 44.4] }
            ],
            practicePlaces: []
        },
        {
            id: 18,
            title: "מפה 18: אשור, בבל ומצרים – מותו של יאשיהו",
            bounds: "empires",
            places: ["מגידו"],
            fadedPlaces: ["דמשק", "חצור", "גזר", "ירושלים", "כרכמיש"],
            regions: ["צור", "אשור", "בבל", "מצרים", "יהודה", "ישראל"],
            features: [
                { type: "river", id: "euphrates" },
                { type: "river", id: "tigris" },
                { type: "riverlabel", text: "נהר פרת", pos: [36.25, 39.4] },
                { type: "riverlabel", text: "נהר החידקל", pos: [34.3, 44.4] }
            ],
            practicePlaces: ["אשור", "בבל", "מצרים", "מגידו"]
        },
        {
            id: 19,
            title: "מפה 19: האימפריה הבבלית",
            bounds: "empires",
            places: ["רבלה"],
            regions: ["אשור", "יהודה", "מצרים", "האימפריה הבבלית"],
            features: [
                { type: "river", id: "euphrates" },
                { type: "river", id: "tigris" },
                { type: "riverlabel", text: "נהר פרת", pos: [36.25, 39.4] },
                { type: "riverlabel", text: "נהר החידקל", pos: [34.3, 44.4] }
            ],
            practicePlaces: ["בבל"]
        }
    ]
};
